In [1]:
import pandas as pd
import numpy as np

In [2]:
df1 = pd.DataFrame(np.random.randint(5, size=(3,2)), index=list('abc'), columns=list('xy'))
df1.iloc[0,0] = np.nan
df1

     x  y
a  NaN  1
b  3.0  1
c  3.0  3

In [3]:
df2 = pd.DataFrame(np.random.randint(5, size=(3,2)), index=list('abc'), columns=list('xy'))
df2.iloc[1,1] = np.nan
df2

   x    y
a  3  0.0
b  1  NaN
c  1  4.0

### remove duplicates and sort

In [4]:
df1.loc['c',:] = df1.loc['b',:]
df1.drop_duplicates()

     x    y
a  NaN  1.0
b  3.0  1.0

In [5]:
df2 = df2.sort_values(['x','y'], ascending=[True,False])
df2

   x    y
c  1  4.0
b  1  NaN
a  3  0.0

In [6]:
df2.sort_index()

   x    y
a  3  0.0
b  1  NaN
c  1  4.0

In [7]:
df2.reset_index(drop=True)

   x    y
0  1  4.0
1  1  NaN
2  3  0.0

### deal with nan

In [8]:
df1.dropna()

     x    y
b  3.0  1.0
c  3.0  1.0

In [9]:
df1.fillna(1)

     x    y
a  1.0  1.0
b  3.0  1.0
c  3.0  1.0

In [10]:
df1.fillna(df2)

     x    y
a  3.0  1.0
b  3.0  1.0
c  3.0  1.0